//s＜250         没有折扣
//250≤S＜500    2％折扣
//500≤S＜1000   5％折扣
//1000≤S＜2000  8％折扣
//2000≤S＜3000  10％折扣
//3000≤S        15％折扣
//设每公里每吨货物的基本运费为p，货物重为w，距离为s，折扣为d，则总运费f的计算公式为f=p*w*s*(1-d)。
#include<stdio.h>
int main() 
{
	float p,w,s,f,d;
	scanf("%f%f%f",&p,&w,&s);
	if(s<250){
		d=0;
	}
	else if(s>=250&&s<500){
		d=0.02;
	}
	else if(s>=500&&s<1000){
		d=0.05;
	}
	else if(s>=1000&&s<2000){
		d=0.08;
	}
	else if(s>=2000&&s<3000){
		d=0.1;
	}
	else if(s>=3000){
		d=0.15;
	}
	f=p*w*s*(1-d);
	printf("%f",f);
	return 0;
}
